DotBots/lh2_on_rp2040/lh2/lh2.c
static const uint32_t _polynomials[LH2_POLYNOMIAL_COUNT] = {
    0x0001D258,
    0x00017E04,
    0x0001FF6B,
    0x00013F67,
    0x0001B9EE,
    0x000198D1,
    0x000178C7,
    0x00018A55,
};

static const uint32_t _end_buffers[LH2_POLYNOMIAL_COUNT][NUM_LSFR_COUNT_CHECKPOINTS] = {
    {
        // p0
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b10000000000011010,
        0b10000001010110001,
        0b10111000000110000,
        0b10101010110011101,
        0b10100001010111011,
        0b01011000111100110,
        0b00011011100000011,
        0b10001010101011010,
        0b01001010001111101,
        0b00010010100011000,
        0b00000100111000011,
        0b11001100100000010,
        0b00111111101111011,
        0b10110010010110001,
        0b01110001000110111,
        0b01100101100011111,
        0b11010001101010100,
        0b00011011101110011,
        0b10001110100000011,
        0b10010001101011110,
        0b11011011010100011,
        0b11011111100110001,
        0b00010100010110011,
        0b10100011001011111,
        0b00111110110000100,
        0b10001100001010011,
        0b11100011011100000,
        0b11110001010110001,
        0b11101000000111110,
        0b00011010010010011,
        0b10101010010100101,
        0b10111000110011011,
        0b10111111000001001,
        0b00101101110010101,
        0b10100100100011100,
        0b10100110100011110,
        0b11001000101110010,
        0b11100111100101101,
        0b00111101010100010,
        0b11001101100010000,
        0b00001001001100101,
        0b10001010111010001,
        0b01000111000001001,
        0b01000101110011111,
        0b00111100011000011,
        0b11111111000001001,
        0b11101101110000010,
        0b11100101011110101,
        0b01000010100110110,
        0b10110111000100001,
        0b10010110011001011,
        0b01001001110110111,
        0b01011011110010010,
        0b01000110110010010,
        0b01100101110010010,
        0b11011100110011101,
        0b01000011010111101,
        0b10010110101000000,
        0b01011111011001111,
        0b10000110101101011,
        0b00101100111011001,
        0b10010101110100110,
        0b00001110011011111,
    },
    {
        // p1
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b00000001111100000,
        0b11111111000111010,
        0b10111000111011000,
        0b11010000110111110,
        0b10001100001111010,
        0b10010111100011101,
        0b10011100011010010,
        0b10110111100111100,
        0b11101101100100000,
        0b11110110110010101,
        0b01110110111101110,
        0b11000010101101111,
        0b01101111000011101,
        0b01000000000111001,
        0b01010101101000101,
        0b00101110001101110,
        0b11010000111010000,
        0b00001100001001010,
        0b11011100001000011,
        0b01000011000110100,
        0b00001101001011100,
        0b11010100111100011,
        0b10100011000111100,
        0b00010001010011110,
        0b01011011010101010,
        0b10101110010010010,
        0b10100001010111011,
        0b10100101111010001,
        0b01010111100110110,
        0b11110110001100000,
        0b10000101000110111,
        0b10011000000100001,
        0b00110001110110000,
        0b10100001010001101,
        0b11100111111101000,
        0b01110011011010110,
        0b11010000101111011,
        0b10101001001000100,
        0b00010000111001111,
        0b00100011101000011,
        0b00110110001000011,
        0b11110011101001111,
        0b10100101011110000,
        0b10111011010000101,
        0b11001010000111101,
        0b11101011111010011,
        0b00000001110111100,
        0b00110010100110110,
        0b00101111010110001,
        0b11101110010000001,
        0b10011100010011101,
        0b01000111111100110,
        0b01100111101100011,
        0b10100100000010011,
        0b11011100110100101,
        0b10001101000111011,
        0b01001010000111000,
        0b11100110011110111,
        0b11111000000100100,
        0b00111100110011100,
        0b11011000110000110,
        0b00011011111011000,
        0b10011000101010001,
    },
    {
        // p2
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b11001110010011010,
        0b00111011100000111,
        0b10011010101111011,
        0b00011011011000100,
        0b01100001111001001,
        0b00100011000101100,
        0b01110100001110110,
        0b01011101010010110,
        0b00011111001011100,
        0b11111101101001011,
        0b00110100010100010,
        0b11001011001101010,
        0b01100110111001010,
        0b01000010000110001,
        0b00011011111101001,
        0b01110001111011010,
        0b01011010100110111,
        0b10010110101101111,
        0b01001001010111011,
        0b10110110011111010,
        0b10010001010110000,
        0b11001011000000110,
        0b00001011000001000,
        0b10110001110000001,
        0b11111010001101100,
        0b01110110010001010,
        0b00100000010110111,
        0b10001001011101001,
        0b00100101110000111,
        0b10001100100001100,
        0b10000011101111100,
        0b00000010011101011,
        0b01010000011010001,
        0b01011110000100010,
        0b00100100000010110,
        0b01100010101111011,
        0b01101010010110001,
        0b00110111001111111,
        0b11010110101011110,
        0b00111000001101111,
        0b01000010110010001,
        0b01010110110011001,
        0b00110011110100111,
        0b10101011100111000,
        0b11010010001000100,
        0b11001011111100111,
        0b01001000000110001,
        0b01111110101111111,
        0b01111000110111110,
        0b11101100001001001,
        0b00011010000000010,
        0b01000011110101010,
        0b11111111111010011,
        0b10001011001010010,
        0b00100100100111000,
        0b01001011100000011,
        0b11111101110110110,
        0b10111111010001011,
        0b10101111001100000,
        0b00010110111101110,
        0b10100010011011000,
        0b01111001011100111,
        0b10000110110011101,
    },
    {
        // p3
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b00101100000100010,
        0b10001100001111000,
        0b10001110100110011,
        0b11011011110010110,
        0b00010010100101011,
        0b01001100111011111,
        0b00110011010010101,
        0b11000100000001101,
        0b01010011010101100,
        0b01111100110100001,
        0b10011011011110001,
        0b11100011000010110,
        0b00010000010000010,
        0b10110110011111000,
        0b00110111011100001,
        0b00011111010001100,
        0b00000101100001100,
        0b01011000011110010,
        0b10111011011111111,
        0b11000001011110011,
        0b11011000000000011,
        0b00011011000101100,
        0b10100101100010011,
        0b10011101110001010,
        0b11110010001000101,
        0b10001011101110001,
        0b01010010000000110,
        0b00001011001111000,
        0b10000000110111001,
        0b00010001010100001,
        0b10100111110001010,
        0b00111100010000101,
        0b11001101011101111,
        0b11000010010010010,
        0b01100010001001001,
        0b01001111001010100,
        0b10000000010000100,
        0b11010011011101100,
        0b01000111000101000,
        0b01011010010110011,
        0b10100000101001111,
        0b10101110100001100,
        0b00010101100111011,
        0b11111101010001100,
        0b01100000101101000,
        0b10001011110011100,
        0b10001100100101101,
        0b00110101011011111,
        0b11010110000110010,
        0b11101011101110000,
        0b00010111001011011,
        0b01110110010101011,
        0b00111001000001010,
        0b10111101110100011,
        0b11001111000000011,
        0b00010000110100010,
        0b01111110100101011,
        0b00011001010001101,
        0b11111001111101101,
        0b00010111110101110,
        0b10011101110100010,
        0b10011100001001111,
        0b00101011101001101,
    },
    {
        // p4
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b00111101010111100,
        0b01010011100100100,
        0b01100001100011000,
        0b11000011111110101,
        0b00100100011111011,
        0b00010000110000011,
        0b10001000111100101,
        0b01111110000100101,
        0b11010110111101011,
        0b01110001000011100,
        0b10101100100110100,
        0b01011100011111100,
        0b11001111011011111,
        0b00100101010010110,
        0b00010011000100100,
        0b11001000111100000,
        0b10110111000100001,
        0b00110000001111000,
        0b10101100001001111,
        0b00010001010010110,
        0b01001001110100010,
        0b01010001110000110,
        0b00101110010101101,
        0b00100010100111011,
        0b01000010110100110,
        0b01110110111010010,
        0b10101110001110110,
        0b10111101100101000,
        0b01000010111011011,
        0b11010100011001110,
        0b01010011110010111,
        0b01000101010111010,
        0b11110110100000001,
        0b01101011000100010,
        0b01101101111000101,
        0b10111101100011011,
        0b10011110001001000,
        0b00110101110101111,
        0b10011111101011101,
        0b11110100111101000,
        0b10110000011111110,
        0b00001100010101110,
        0b11100011111011001,
        0b11100010000111100,
        0b11001001011110111,
        0b10000011010010101,
        0b01010001101001001,
        0b11010010101101010,
        0b01001101001100111,
        0b00110110011011100,
        0b00111000010100101,
        0b01101100110010010,
        0b01000010000010001,
        0b01001000111110101,
        0b10101110010001100,
        0b11111000100010000,
        0b10111001000011000,
        0b00100101111101011,
        0b00111011000100010,
        0b00111011101100011,
        0b10001010110100100,
        0b10011010101100001,
        0b10111100101010110,
    },
    {
        // p5
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b10000110010011101,
        0b10010100110011101,
        0b11101111001011001,
        0b11001000010011110,
        0b01111111110111110,
        0b00100011010001111,
        0b01011101110101000,
        0b10011010101100010,
        0b00111101111110011,
        0b00110010000110101,
        0b10100111011001111,
        0b01100111010001011,
        0b00100010110011110,
        0b00011010000101110,
        0b11001001101001100,
        0b11011011100110100,
        0b00000010111000100,
        0b11111011010010001,
        0b00100100000011000,
        0b01001000001001100,
        0b10111011101111001,
        0b00111001100101000,
        0b00111011000011100,
        0b11000001001111010,
        0b10010010011100111,
        0b11000001101100001,
        0b11010010110000101,
        0b11001000010010000,
        0b00010111101011110,
        0b01000110001101000,
        0b01110001010000100,
        0b10001110110110000,
        0b00111111101100011,
        0b01000000111011101,
        0b11000001100011101,
        0b11111001001100101,
        0b10000110101001011,
        0b01011111100010011,
        0b11110001000101010,
        0b01100001010010111,
        0b01101011100011111,
        0b01101110000100100,
        0b00101101001000111,
        0b01000110101100010,
        0b10010000010110000,
        0b01111011100011110,
        0b00110011110101011,
        0b11010011000101000,
        0b01011110110001100,
        0b00101011110111001,
        0b00010100001111011,
        0b01011001111000111,
        0b00010100011100111,
        0b11011110010111101,
        0b11111000111011101,
        0b10011010110011010,
        0b01101010000110010,
        0b10101111110000010,
        0b00110111001010101,
        0b00001001000001110,
        0b00000010110111000,
        0b11010000101110001,
        0b01101010111000011,
    },
    {
        // p6
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b00010010000111001,
        0b01001101111111100,
        0b00010100111011111,
        0b01110110101110110,
        0b01010101000001110,
        0b00111001110010110,
        0b00011000111001010,
        0b00111111000100011,
        0b00111010001001001,
        0b10010001101110110,
        0b10011110001110100,
        0b10011010110110011,
        0b11110010100110101,
        0b11100001000101111,
        0b11010000111111101,
        0b11110001001110000,
        0b10010001111000110,
        0b10100011001000001,
        0b10001000011101000,
        0b10001101001000111,
        0b11100111010110100,
        0b00001010100010001,
        0b01110010010010001,
        0b01001000110110000,
        0b01011010000010000,
        0b01100110100001100,
        0b10111001000100001,
        0b01000011100101101,
        0b10111010001110010,
        0b11011001111000001,
        0b10110000010001111,
        0b00100110001001001,
        0b11000011000110001,
        0b11110011100010110,
        0b01011101101010000,
        0b11001011101000100,
        0b11100001011010110,
        0b11111111100000101,
        0b10000100111001101,
        0b11001011011100111,
        0b11101110011001010,
        0b11001100100001001,
        0b10001001000101101,
        0b11001101100101000,
        0b01011001111000100,
        0b01111010110011010,
        0b00110011110100011,
        0b00100011001101100,
        0b11101010000001011,
        0b11110100100010110,
        0b11011011000111000,
        0b01011101001100000,
        0b11000100010110001,
        0b10000111011101111,
        0b10010001111111101,
        0b11111001011001111,
        0b11101011111101111,
        0b00100101001100010,
        0b10100000011000110,
        0b01001101000100110,
        0b11000110110101010,
        0b01101010101001110,
        0b00010101100100011,
    },
    {
        // p7
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b11111111111001011,
        0b10101101101100110,
        0b00100101101010000,
        0b01000010111001111,
        0b10010001000110001,
        0b10010100011110001,
        0b10010110111000011,
        0b00011111000011111,
        0b00011000111000111,
        0b01101000010001001,
        0b00001010011011000,
        0b00100101010100111,
        0b01110010111010110,
        0b00101101000111111,
        0b11111010001011001,
        0b10001110011000110,
        0b10010110011101110,
        0b11001101111111010,
        0b01001101110010110,
        0b01000011011111110,
        0b11101100100011100,
        0b10000101011010011,
        0b11111111100101101,
        0b01001001000001101,
        0b11001101110001101,
        0b01000000110011101,
        0b11000001101011011,
        0b01110011110100100,
        0b01110011011101110,
        0b01010001111111000,
        0b01011101100100000,
        0b10010000110101010,
        0b11111001001110010,
        0b10000001100101101,
        0b10000001000010111,
        0b01010001101010011,
        0b10110010100011000,
        0b11001101110101011,
        0b01000101000110100,
        0b00011011000110101,
        0b10101100110101110,
        0b10010110011010111,
        0b00110100110001110,
        0b11001100101110100,
        0b11110100100010010,
        0b11011011001101110,
        0b10100101000101111,
        0b10011000101101111,
        0b10000111001010110,
        0b01001100000100100,
        0b00101010011110001,
        0b10100001000111100,
        0b11010101101110010,
        0b11111000011101010,
        0b11000101010011110,
        0b11110100001010000,
        0b00000111000000100,
        0b01000100101100001,
        0b01101001011000111,
        0b01010010010011110,
        0b10001111110000100,
        0b11100110010111101,
        0b10000101011010000,
    },
};

static uint16_t _end_buffers_hashtable[HASH_TABLE_SIZE] = { 0 };

// Dynamic checkpoint
static uint32_t _lfsr_checkpoint_bits[LH2_POLYNOMIAL_COUNT][LH2_SWEEP_COUNT]  = { 0 };  ///<
static uint32_t _lfsr_checkpoint_count[LH2_POLYNOMIAL_COUNT][LH2_SWEEP_COUNT] = { 0 };
static uint32_t _lsfr_checkpoint_average                                      = 0;

///< Encodes in two bits which sweep slot of a particular basestation is empty, (1 means data, 0 means empty)
typedef enum {
    LH2_SWEEP_BOTH_SLOTS_EMPTY,   ///< Both sweep slots are empty
    LH2_SWEEP_SECOND_SLOT_EMPTY,  ///< Only the second sweep slot is empty
    LH2_SWEEP_FIRST_SLOT_EMPTY,   ///< Only the first sweep slot is empty
    LH2_SWEEP_BOTH_SLOTS_FULL,    ///< Both sweep slots are filled with raw data
} db_lh2_sweep_slot_state_t;

