DotBots/lh2_on_rp2040/lh2/lh2.c
    // Save raw data information
    lh2->raw_data[sweep][basestation].bit_offset          = temp_bit_offset;
    lh2->raw_data[sweep][basestation].selected_polynomial = temp_selected_polynomial;
    lh2->raw_data[sweep][basestation].bits_sweep          = temp_bits_sweep;
    lh2->timestamps[sweep][basestation]                   = temp_timestamp;
    // Save processed location information
    lh2->locations[sweep][basestation].lfsr_location       = lfsr_loc_temp;
    lh2->locations[sweep][basestation].selected_polynomial = temp_selected_polynomial;
    // Mark the data point as processed
    lh2->data_ready[sweep][basestation] = DB_LH2_PROCESSED_DATA_AVAILABLE;
}

//=========================== private ==========================================

void _initialize_ts4231(const uint8_t gpio_d, const uint8_t gpio_e) {

    // Filip's code define these pins as inputs, and then changes them quickly to outputs. Not sure why, but it works.
    gpio_init(gpio_d);
    gpio_init(gpio_e);
    gpio_set_dir(gpio_d, GPIO_IN);
    gpio_set_dir(gpio_e, GPIO_IN);

    // start the TS4231 initialization
    // Wiggle the Envelope and Data pins
    gpio_set_dir(gpio_e, GPIO_OUT);
    sleep_us(10);
    gpio_put(gpio_e, 1);
    sleep_us(10);
    gpio_put(gpio_e, 0);
    sleep_us(10);
    gpio_put(gpio_e, 1);
    sleep_us(10);
    gpio_set_dir(gpio_d, GPIO_OUT);
    sleep_us(10);
    gpio_put(gpio_d, 1);
    sleep_us(10);
    // Turn the pins back to inputs
    gpio_set_dir(gpio_d, GPIO_IN);
    gpio_set_dir(gpio_e, GPIO_IN);
    // finally, wait 1 milisecond
    sleep_us(1000);

    // Send the configuration magic number/sequence
    uint16_t config_val = 0x392B;
    // Turn the Data and Envelope lines back to outputs and clear them.
    gpio_set_dir(gpio_d, GPIO_OUT);
    gpio_set_dir(gpio_e, GPIO_OUT);
    sleep_us(10);
    gpio_put(gpio_d, 0);
    sleep_us(10);
    gpio_put(gpio_e, 0);
    sleep_us(10);
    // Send the magic configuration value, MSB first.
    for (uint8_t i = 0; i < 15; i++) {

        config_val = config_val << 1;
        if ((config_val & 0x8000) > 0) {
            gpio_put(gpio_d, 1);
        } else {
            gpio_put(gpio_d, 0);
        }

        // Toggle the Envelope line as a clock.
        sleep_us(10);
        gpio_put(gpio_e, 1);
        sleep_us(10);
        gpio_put(gpio_e, 0);
        sleep_us(10);
    }
    // Finish send sequence and turn pins into inputs again.
    gpio_put(gpio_d, 0);
    sleep_us(10);
    gpio_put(gpio_e, 1);
    sleep_us(10);
    gpio_put(gpio_d, 1);
    sleep_us(10);
    gpio_set_dir(gpio_d, GPIO_IN);
    gpio_set_dir(gpio_e, GPIO_IN);
    // Finish by waiting 10usec
    sleep_us(10);

    // Now read back the sequence that the TS4231 answers.
    gpio_set_dir(gpio_d, GPIO_OUT);
    gpio_set_dir(gpio_e, GPIO_OUT);
    sleep_us(10);
    gpio_put(gpio_d, 0);
    sleep_us(10);
    gpio_put(gpio_e, 0);
    sleep_us(10);
    gpio_put(gpio_d, 1);
    sleep_us(10);
    gpio_put(gpio_e, 1);
    sleep_us(10);
    // Set Data pin as an input, to receive the data
    gpio_set_dir(gpio_d, GPIO_IN);
    sleep_us(10);
    gpio_put(gpio_e, 0);
    sleep_us(10);
    // Use the Envelope pin to output a clock while the data arrives.
    for (uint8_t i = 0; i < 14; i++) {
        gpio_put(gpio_e, 1);
        sleep_us(10);
        gpio_put(gpio_e, 0);
        sleep_us(10);
    }

    // Finish the configuration procedure
    gpio_set_dir(gpio_d, GPIO_OUT);
    sleep_us(10);
    gpio_put(gpio_e, 1);
    sleep_us(10);
    gpio_put(gpio_d, 1);
    sleep_us(10);

    gpio_put(gpio_e, 0);
    sleep_us(10);
    gpio_put(gpio_d, 0);
    sleep_us(10);
    gpio_put(gpio_e, 1);
    sleep_us(10);

    gpio_set_dir(gpio_d, GPIO_IN);
    gpio_set_dir(gpio_e, GPIO_IN);

    sleep_us(50000);
}

uint64_t _demodulate_light(uint8_t *sample_buffer) {  // bad input variable name!!
    // TODO: rename sample_buffer
    // TODO: make it a void and have chips be a modified pointer thingie
    // FIXME: there is an edge case where I throw away an initial "1" and do not count it in the bit-shift offset, resulting in an incorrect error of 1 in the LFSR location
    uint8_t chip_index;
    uint8_t local_buffer[128];
    uint8_t zccs_1[128];
    uint8_t chips1[128];  // TODO: give this a better name.
    uint8_t temp_byte_N;  // TODO: bad variable name "temp byte"
    uint8_t temp_byte_M;  // TODO: bad variable name "temp byte"

    // initialize loop variables
    uint8_t  ii = 0x00;
    int      jj = 0;
    int      kk = 0;
    uint64_t gg = 0;

    // initialize temporary "ones counter" variable that counts consecutive ones
    int ones_counter = 0;

    // initialize result:
    uint64_t chipsH1 = 0;

    // FIND ZERO CROSSINGS
    chip_index         = 0;
    zccs_1[chip_index] = 0x01;

    memcpy(local_buffer, sample_buffer, 128);

    // for loop over bytes of the SPI buffer (jj), nested with a for loop over bits in each byte (ii)
    for (jj = 0; jj < 128; jj++) {
        // edge case - check if last bit (LSB) of previous byte is the same as first bit (MSB) of current byte
        // if it is not, increment chip_index and reset count
        if (jj != 0) {
            temp_byte_M = (local_buffer[jj - 1]) & (0x01);   // previous byte's LSB
            temp_byte_N = (local_buffer[jj] >> 7) & (0x01);  // current byte's MSB
            if (temp_byte_M != temp_byte_N) {
                chip_index++;
                zccs_1[chip_index] = 1;
            } else {
                zccs_1[chip_index] += 1;
            }
        }
        // look at one byte at a time
        for (ii = 7; ii > 0; ii--) {
            temp_byte_M = ((local_buffer[jj]) >> (ii)) & (0x01);      // bit shift by ii and mask
            temp_byte_N = ((local_buffer[jj]) >> (ii - 1)) & (0x01);  // bit shift by ii-1 and mask
            if (temp_byte_M == temp_byte_N) {
                zccs_1[chip_index] += 1;
            } else {
                chip_index++;
                zccs_1[chip_index] = 1;
            }
        }
    }

