DotBots/lh2_on_rp2040/lh2/lh2.c
        // Check end_buffer backward count
        // Lower hash option in the hash table
        hash_index_down = _end_buffers_hashtable[(buffer_down >> 2) & HASH_TABLE_MASK] & CHECKPOINT_TABLE_MASK_LOW;
        if (buffer_down == _end_buffers_local[hash_index_down]) {
            count_down = count_down + 2048 * hash_index_down - 1;
            _update_lfsr_checkpoints(index, bits, count_down);
            return count_down;
        }
        // Upper hash option in the hash table
        hash_index_down = (_end_buffers_hashtable[(buffer_down >> 2) & HASH_TABLE_MASK] & CHECKPOINT_TABLE_MASK_HIGH) >> CHECKPOINT_TABLE_BITS;
        if (buffer_down == _end_buffers_local[hash_index_down]) {
            count_down = count_down + 2048 * hash_index_down - 1;
            _update_lfsr_checkpoints(index, bits, count_down);
            return count_down;
        }

        // Check end_buffer forward count
        // Lower hash option in the hash table
        hash_index_up = _end_buffers_hashtable[(buffer_up >> 2) & HASH_TABLE_MASK] & CHECKPOINT_TABLE_MASK_LOW;
        if (buffer_up == _end_buffers_local[hash_index_up]) {
            count_up = 2048 * hash_index_up - count_up - 1;
            _update_lfsr_checkpoints(index, bits, count_up);
            return count_up;
        }
        // Upper hash option in the hash table
        hash_index_up = (_end_buffers_hashtable[(buffer_up >> 2) & HASH_TABLE_MASK] & CHECKPOINT_TABLE_MASK_HIGH) >> CHECKPOINT_TABLE_BITS;
        if (buffer_up == _end_buffers_local[hash_index_up]) {
            count_up = 2048 * hash_index_up - count_up - 1;
            _update_lfsr_checkpoints(index, bits, count_up);
            return count_up;
        }

        // Check the dynamical checkpoints, backward
        if (buffer_down == _lfsr_checkpoint_bits[index][0]) {
            count_down = count_down + _lfsr_checkpoint_count[index][0];
            _update_lfsr_checkpoints(index, bits, count_down);
            return count_down;
        }
        if (buffer_down == _lfsr_checkpoint_bits[index][1]) {
            count_down = count_down + _lfsr_checkpoint_count[index][1];
            _update_lfsr_checkpoints(index, bits, count_down);
            return count_down;
        }

        // Check the dynamical checkpoints, forward
        if (buffer_up == _lfsr_checkpoint_bits[index][0]) {
            count_up = _lfsr_checkpoint_count[index][0] - count_up;
            _update_lfsr_checkpoints(index, bits, count_up);
            return count_up;
        }
        if (buffer_up == _lfsr_checkpoint_bits[index][1]) {
            count_up = _lfsr_checkpoint_count[index][1] - count_up;
            _update_lfsr_checkpoints(index, bits, count_up);
            return count_up;
        }

        //
        // LSFR UPDATE
        //
        // LSFR backward update
        b17         = buffer_down & 0x00000001;                                                      // save the "newest" bit of the buffer
        buffer_down = (buffer_down & (0x0001FFFE)) >> 1;                                             // shift the buffer right, backwards in time
        masked_buff = (buffer_down) & (polynomials_local);                                           // mask the buffer w/ the selected polynomial
        buffer_down = buffer_down | (((__builtin_popcount(masked_buff) ^ b17) & 0x00000001) << 16);  // This weird line propagates the LSFR one bit into the past
        count_down++;

        // LSFR forward update
        b1        = __builtin_popcount(buffer_up & polynomials_local) & 0x01;  // mask the buffer w/ the selected polynomial
        buffer_up = ((buffer_up << 1) | b1) & (0x0001FFFF);
        count_up++;
    }
    return count_up;
}

void _add_to_spi_ring_buffer(lh2_ring_buffer_t *cb, uint8_t *data, uint32_t timestamp) {

    memcpy(cb->buffer[cb->writeIndex], data, SPI_BUFFER_SIZE);
    cb->timestamps[cb->writeIndex] = timestamp;
    cb->writeIndex                 = (cb->writeIndex + 1) % LH2_BUFFER_SIZE;

    if (cb->count < LH2_BUFFER_SIZE) {
        cb->count++;
    } else {
        // Overwrite oldest data, adjust readIndex
        cb->readIndex = (cb->readIndex + 1) % LH2_BUFFER_SIZE;
    }
}

bool _get_from_spi_ring_buffer(lh2_ring_buffer_t *cb, uint8_t *data, uint32_t *timestamp) {
    if (cb->count == 0) {
        // Buffer is empty
        return false;
    }

    memcpy(data, cb->buffer[cb->readIndex], SPI_BUFFER_SIZE);
    *timestamp    = cb->timestamps[cb->readIndex];
    cb->readIndex = (cb->readIndex + 1) % LH2_BUFFER_SIZE;
    cb->count--;

    return true;
}

void _fill_hash_table(uint16_t *hash_table) {

    // Iterate over all the checkpoints and save the HASH_TABLE_BITS 11 bits as a a index for the hashtable
    for (size_t poly = 0; poly < LH2_POLYNOMIAL_COUNT; poly++) {
        for (size_t checkpoint = 1; checkpoint < NUM_LSFR_COUNT_CHECKPOINTS; checkpoint++) {
            if (hash_table[(_end_buffers[poly][checkpoint] >> 2) & HASH_TABLE_MASK] == 0) {  // We shift by 2 to the right because we precomputed that that hash has the least amount of collisions in the hash table

                hash_table[(_end_buffers[poly][checkpoint] >> 2) & HASH_TABLE_MASK] = checkpoint & CHECKPOINT_TABLE_MASK_LOW;  // that element of the hash table is empty, copy the checkpoint into the lower 6 bits
            } else {
                hash_table[(_end_buffers[poly][checkpoint] >> 2) & HASH_TABLE_MASK] |= (checkpoint << CHECKPOINT_TABLE_BITS) & CHECKPOINT_TABLE_MASK_HIGH;  // If the element is already occupied, use the upper 6 bits
            }
        }
    }
}

void _update_lfsr_checkpoints(uint8_t polynomial, uint32_t bits, uint32_t count) {

    // Update the current running weighted sum. 75% of old value +25% of new value
    _lsfr_checkpoint_average = (((_lsfr_checkpoint_average * 3) >> 2) + (count >> 2));

    // Is the new count higher or lower than the current running average.
    uint8_t index = count <= _lsfr_checkpoint_average ? 0 : 1;

    // Save the new count in the correct place in the checkpoint array
    _lfsr_checkpoint_bits[polynomial][index]  = bits;
    _lfsr_checkpoint_count[polynomial][index] = count;
}

uint8_t _select_sweep(db_lh2_t *lh2, uint8_t polynomial, uint32_t timestamp) {
    // TODO: check the exact, per-mode period of each polynomial instead of using a blanket 20ms

    uint8_t  basestation = polynomial >> 1;  ///< each base station uses 2 polynomials. integer dividing by 2 maps the polynomial number to the basestation number.
    uint32_t now         = db_timer_hf_now(LH2_TIMER_DEV);
    // check that current data stored is not too old.
    for (size_t sweep = 0; sweep < 2; sweep++) {
        if (now - lh2->timestamps[0][basestation] > LH2_MAX_DATA_VALID_TIME_US) {
            // Remove data that is too old.
            lh2->raw_data[sweep][basestation].bits_sweep          = 0;
            lh2->raw_data[sweep][basestation].selected_polynomial = LH2_POLYNOMIAL_ERROR_INDICATOR;
            lh2->raw_data[sweep][basestation].bit_offset          = 0;
            lh2->timestamps[sweep][basestation]                   = 0;
            lh2->data_ready[sweep][basestation]                   = DB_LH2_NO_NEW_DATA;
            // I don't think it's worth it to remove the location data. It is already marked as "No new data"
        }
    }

    ///< Encode in two bits which sweep slot of this basestation is empty, (1 means data, 0 means empty)
    uint8_t sweep_slot_state = ((lh2->timestamps[1][basestation] != 0) << 1) | (lh2->timestamps[0][basestation] != 0);
    // by default, select the first slot
    uint8_t selected_sweep = 0;

    switch (sweep_slot_state) {

